app/Helpers/CommonHelper.php

select * from `categories` where `status` = 'Active'
---
	public static function getAllCategory(){
		$getAllUser = Category::where('status','Active')->get()->toArray();

select * from `sub_categories` where `status` = 'Active'
---
	public static function getAllSubCategory(){
		$SubCategory = SubCategory::where('status','Active')->get()->toArray();