app/Http/Controllers/AjaxController.php

select * from `sub_categories` where exists (select * from `categories` where `sub_categories`.`category_id` = `categories`.`id` and `slug` = 'spotlight')
---
    public function activeSubcategory(Request $request){
        //$records = SubCategory::where('category_id', $request->category_id)->get();
        $records = SubCategory::whereHas('Category', function (Builder $query) use($request) {
                                $query->where('slug',$request->category_slug);