app/Http/Controllers/HomeController.php

       public function index()
    {
    	try{
	        $service = User::where('user_type','vendor')->orderBy('id','Desc')->get()->toArray();
---
select * from `users` where `user_type` = 'vendor' order by `id` desc