app/Models/Country.php

    public static function getCountryList(){
        $result = \App\Models\Country::where(['status'=> 'Active'])->get();
---
select * from `countries` where (`status` = 'Active')